Repository: hafdon/translation-an-corpan
Catalog: omegat/project_save.tmx
Source language: ga
Languages: en_us

source: — Beidh Daithí Fitzwalter i mbun an tsearmanais agus tá ráfla ann go mbeidh an tUachtarán ann chomh maith.
en_us: Daithi Fitzwalter will be in charge of the ceremony and there is a rumor that the President will be there as well.

source: — Beidh an sarcófagas á oscailt oíche amárach os comhair cheamaraí an domhain mhóir, ar sé.
en_us: — The sarcophagus will be opened tomorrow night in front of the cameras of the whole world, he said.

source: — Bheifeá dainséarach dá mbeadh smeadar céille agat, a Mháirtín, agus sin í an fhírinne!
en_us: — You would be if you would have an ounce of sense, Martin, and that's the truth!

source: — Bhuel, a Dhaid, an chéad rud eile is cuimhin liom ná dúiseacht anseo.
en_us: — Well, Dad, the next thing I remember I was waking up here.

source: — Bhí cónra mhór mhillteach sa seomra céanna – an sarcófagas seo.
en_us: The large awful coffin was in the same room - this sarcophagus.

source: — Bhí imní orm go mbeadh an scéal níos measa, a dúirt Bean Uí Ghríofa.
en_us: — I was worried that the events were much worse, said Mrs. O'Griofa.

source: — Bhíodh na Manatayaigh ag adhradh déithe éagsúla, arsa Tomás, — agus ba mheascán de dhaoine agus d'ainmhithe cuid de na déithe sin, leathdhuine-leathiaguar, leathdhuine-leathanacanda nó an pearóid-duine.
en_us: — The Manataya worshipped different gods, said Thomas, — and some of those gods were hybrids of peolpe and animals: half-man, half-jaguar; half-man, half-anaconda; or the parrot man.

source: — Bob, tá imní mór orm.
en_us: — Bob, I'm actually worried.

source: — Bíonn an iomarca clár teilifíse ann na laethanta seo, chuirfeadh siad scanradh ort .
en_us: — There are a lot of television programs these days, scaring you.

source: — Caithfidh mé breathnú ar cheann nó dhó de thorthaí na dtástálacha, ach tá mé cinnte go mbeidh Pól in ann dul abhaile anocht.
en_us: — I have to look at one or two of the test results, but I'm sure that Paul will be able to go home tonight.

source: — Ceart go leor, ach bígí béasach fad a bhíonn Tomás ag caint, arsa Bean Uí Ruiséil.
en_us: — Good enough, but be polite while Tomas is talking, said Mrs. O'Russell.

source: — Ceart go leor, ach ná bígí i bhfad, arsa an Mháistreás.
en_us: — Ok, but don't be long, said the teacher.

source: — Chreid na Manatayaigh go gur stróiceadh an dia dá speisialta seo daoine ina bpíosaí lena ghob géar láidir.
en_us: — The Manataya believed that this special god tore people into pieces with his strong sharp beak.

source: — Creideann na staraithe gur chum cinnirí na Manatayach an scéal ar fad.
en_us: The historians believe that the leaders of the Manataya created the story completely.

source: — Creidim, is dóigh, ach is féidir gur ghoid duine éigin an corp, a d'fhreagair Pól go smaointeach.
en_us: I do, I suppose, but it's possible that someone stole the body, Paul answered thoughfully.

source: — Cuireadh scanradh croí orainn nuair a ghlaoigh Bean Uí Ruiséil ón iarsmalann ar maidin.
en_us: — It terrified us when Mrs. O'Russell called from the museum this morning.

source: — Cé go ndearna na Manatayaigh nithe iontacha a fhionnachtain sa mhata agus san eolaíocht na mílte bliain romhainne anseo san Eoraip, chreid siad go láidir fós i sprideanna, i ndraíocht, i bhfantaisíocht agus sna diabhail, agus bhí déithe uafásacha acu.
en_us: — Although the Manataya made wonderful discoveries in mathematics and in the sciences thousands of years before us here in Europe, they still strongly believed in spirits, in magic, in fantasy and in demons, and they had terrifying gods.

source: — Céard atá uait anois, a Mháirtín?
en_us: — What do you want now, Martin?

source: — Deirtear go mbíodh sé ag déanamh íobairte de na céadta fear agus ban d'fhonn a gcuid fola a úsáid mar chógas speisialta leis an mbeatha shíoraí a aimsiú dó féin.
en_us: It's said that he was making sacrifices of hundreds of men and women, wanting to use their blood as special medicine to acquire eternal life for himself.

source: — Faoi mar a tharla san Éigipt, tá a fhios agat .
en_us: Like what happened in Egypt, you know.

source: — Go hiontach, arsa Bean Uí Ghríofa.
en_us: — Excellent, said Mrs. O'Griofa.

source: — Hé, a Aodh, tá sé cosúil le «Tomb Raider», nach bhfuil?
en_us: Hey, Aodh, it's like _Tomb Raider_, isn't it?

source: — In ainneoin an dul chun cinn a rinneadh ó thaobh teicneolaíochta agus eolaíochta de, bhí roinnt nósanna barbartha á gcleachtadh i ríocht na Manatayach go dtí deireadh a sibhialtachta.
en_us: — Despite the progress that was made from a technological and scientific side, some barbaric habits were being practiced in the Manataya kingdom until the end of their civilization.

source: — Is baolach nach féidir.
en_us: — I'm afraid I can't.

source: — Is dóigh liomsa gur cleas é an t-iomlán.
en_us: — I think the whole thing is a trick.

source: — Iuch!
en_us: — Ah!

source: — Meas tú arbh fhearr dúinn cead a lorg anáil a tharraingt chomh maithe?
en_us: Do you think would be better for us to seek permission to draw breath as well?

source: — Mura bhfuil an Playstation sin tar éis dochar buan a dhéanamh dá intinn ní dhéanfaidh rud ar bith é.
en_us: — If that Playstation has not done permanent injury to his mind, nothing could.

source: — Nach iontach an chuma atá orthu?
en_us: — Don't they look great?

source: — Ná bí ag cur imní ar an leaid, a Neans, arsa a Dhaid de ghuth mín.
en_us: — Don't be worrying the lad, Neans, said Dad's smooth voice.

source: — Ná bí do do chur féin trí chéile arís, a Neans, ar sé go ciúin.
en_us: — Don't be getting upset again, Neans, he said quietly.

source: — Ná bí mar sin, a Mham, tá an ceart ag Daid.
en_us: — Don't be like that, Mom, Dad is right.

source: — Ná déan gleo ar bith .
en_us: — Don't make a ruckus.

source: — Ná liomsa, arsa Pól.
en_us: Me neither, said Paul.

source: — Ní deas nó greannmhar a bhí an phearóid, arsa Tomás agus é ag tarraingt ar a fhéasóg bheag.
en_us: — The parrot wasn't nice or funny, said Thomas while he pulled on his small beard.

source: — Níl gach rud ar eolas agatsa, arsa Máirtín go nimhneach agus é ag brú i gcoinne na cónra.
en_us: — You don't know anything, Martin said threateningly while he pushed against the coffin.

source: — Níl pian ar bith orm.
en_us: — I'm not in any pain.

source: — Níl tuairim agam céard faoi a bhfuil tú ag caint.
en_us: — I don't know what you're talking about.

source: — Nó céard?
en_us: — Or what?

source: — Pearóid í sin, is dócha, dar le Pól.
en_us: — That's a parrot, probably, said Paul.

source: — Rud éigin cearr, a Phóil?
en_us: Is something wrong, Paul?

source: — Sarcófagas, a mháistreás.
en_us: — A sarcophagus, ma'am.

source: — Scanradh, baineadh drochphreab as, is cosúil.
en_us: — A fright, he got quite a start, it seems.

source: — Sea, a Mháirtín, agus Steven Spielberg a chum na dineasáir, tá mé cinnte.
en_us: — Yeah, Martin, and Steven Spielberg invented the dinosaurs, I'm sure.

source: — Sea, a Mhéimí?
en_us: — Yes, Meimi?

source: — Seo é, ar sé.
en_us: — This is it, he said.

source: — Sin bealach amháin lena chinntiú nach mbeinn ag breathnú ar an sacar tráthnóna Sathairn.
en_us: — That is one way to make sure that I wouldn't watch the soccer match on Saturday night.

source: — Sin é an fáth a raibh air na tástálacha seo a dhéanamh, le bheith cinnte nach bhfuil dochar buan ar bith déanta duit.
en_us: — That's the reason that he had to do these tests, to be sure that no permanent injury had been done to you.

source: — Smaoinigh air, a bheith faoi ghlas i gcónra, agus tú beo.
en_us: Think about it, being locked in a coffin while you were alive.

source: — Tar éis an chluiche dheireanaigh, sin é an rud ba chóir dóibh a dhéanamh leis an mbainisteoir agus an lántosaí, arsa Pól agus é ag díriú a mhéire i dtreo na mionsamhlacha.
en_us: — After the last game, that's what they should do with the manager and the full forward, said Paul, while pointing a finger towards the diorama.

source: — Tuigimid, arsa an rang ar fad le chéile.
en_us: We understand, said the entire class together.

source: — Tuirseach den taispeántas?
en_us: — Tired of the exhibit?

source: — Tá Pól ceart go leor.
en_us: — Paul is right.

source: — Tá an dochtúir ag rá gur thit tú i laige go tobann agus gur bhuail tú do chloigeann nuair a thit tú siar, arsa a Mham go neirbhíseach.
en_us: — The doctor is saying that you fell from sudden weakness and that you hit your head when you fell down, his mother said nervously.

source: — Tá brón orainn, a Bhean Uí Ruiséil, arsa an bheirt acu trína bhfiacla.
en_us: — We're sorry, Mrs. Russell, said the two of them through their teeth.

source: — Tá brón orm, a Dhaid, céard a dúirt tú?
en_us: — I'm sorry, Dad, what did you say?

source: — Tá go maith, a Phóil, arsa a Mham, fágfaimid tú le codladh a dhéanamh.
en_us: — That's great, Paul, said his mom, we will leave you to get some sleep.

source: — Tá go maith, arsa Aodh Ó Táilliúir.
en_us: — Alright, said Aodh O'Táilliúir.

source: — Tá go maith, tá mé cinnte go bhfuil muid uilig buíoch do Thomás as an stair spéisiúil sin a insint dúinn.
en_us: Alright, I am sure that all of us are thankful for Tomas for that interesting history that he told to us.

source: — Éirigh as, a Mháirtín, arsa Pól.
en_us: — Quit it, Martin, said Paul.

source: —Creideann na staraithe gur bhailigh níos mó ná seacht gcéad duine os comhair na ngeataí oíche amháin.
en_us: — The historians belief that more than seven hundred people gathered in front of the gates one night.

source: —I ndeireadh na dála ní raibh muintir na cathrach in ann cur suas leis an drochíde seo níos mó – a gcuid mac agus iníonacha ag imeacht gan tásc gan tuairisc isteach i ndorchadas phálás Xatlacan, macallaí na screadaí a bhí le cloisteáil taobh thiar de na ballaí arda, na soilse aisteacha a chonaic siad ag glioscarnach trí na fuinneoga.
en_us: — When all was said and done, the people of the city were not able to put up with this abuse anymore - their sons and daughters disappearing out without any report into the darkness of the palace of Xatlacan, the echoes of the screams that were to be heard on the other side of the high walls, the strange lights that they saw flickering through the windows.

source: —Tá an taispeántas an-mhór.
en_us: — The exhibit is very big.

source: — Níl, tá mé go breá.
en_us: — No, I'm great.

source: “A Phóil, a Aodh, sibhse chomh maith.
en_us: Paul, Aodh, you as well.

source: “Fág seo, tá i bhfad níos mó le feiceáil,” a d'ordaigh Bean Uí Ruiséil agus í ag iarraidh an rang a bhogadh ó na mionsamhlacha uafáis.
en_us: Leave this, there is a lot more to see, ordered Mrs. Russell while she tried to move the class from the horror diorama.

source: “Níl muid ach ag léamh mar gheall orthu, arsa Pól Ó Gríofa, gan a shúile a bhaint de na mionsamhlacha a bhí os a chomhair.
en_us: She couldn't move, as her hand was tied to a large stone slab on which she was lying.
